#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.vpc_gateway.data.aws_availability_zones.available: Reading...
module.vpc_backend.data.aws_availability_zones.available: Reading...
data.aws_caller_identity.current: Reading...
module.vpc_gateway.aws_vpc.main: Refreshing state... [id=vpc-0ed5284a4e3dab868]
module.vpc_backend.aws_vpc.main: Refreshing state... [id=vpc-07e8757a7df2c748c]
data.aws_caller_identity.current: Read complete after 0s [id=721500739616]
module.vpc_backend.data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
module.vpc_gateway.data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
module.vpc_gateway.aws_internet_gateway.main: Refreshing state... [id=igw-0dae4bc4d2b982c0b]
module.vpc_gateway.aws_subnet.public[0]: Refreshing state... [id=subnet-0427804112bb86a7a]
module.vpc_gateway.aws_subnet.private[0]: Refreshing state... [id=subnet-0592fa13d6af73c51]
module.vpc_gateway.aws_subnet.public[1]: Refreshing state... [id=subnet-0e352d6961e902b5a]
module.vpc_gateway.aws_subnet.private[1]: Refreshing state... [id=subnet-0dddcaf81fef29b94]
module.vpc_backend.aws_internet_gateway.main: Refreshing state... [id=igw-0d919865767ba6b8c]
module.vpc_backend.aws_subnet.private[1]: Refreshing state... [id=subnet-0bb98995aaab61a69]
module.vpc_backend.aws_subnet.private[0]: Refreshing state... [id=subnet-010f9110cf822fad7]
module.vpc_backend.aws_subnet.public[0]: Refreshing state... [id=subnet-0acc1931c25d7ba97]
module.vpc_backend.aws_subnet.public[1]: Refreshing state... [id=subnet-08077bac729cb5691]
module.vpc_gateway.aws_route_table.public: Refreshing state... [id=rtb-081f390ff974914ef]
module.vpc_gateway.aws_eip.nat[0]: Refreshing state... [id=eipalloc-08cb8cc0884389910]
module.vpc_gateway.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0fd0798beaec01be0]
module.vpc_backend.aws_eip.nat[0]: Refreshing state... [id=eipalloc-082e751678beb3ad5]
module.vpc_backend.aws_route_table.public: Refreshing state... [id=rtb-0bb8e2b36395179b7]
module.vpc_backend.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0e3e33852d656f1a0]
module.vpc_gateway.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0dd325c58e675ff5e]
module.vpc_gateway.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-01f259c56df84847a]
module.vpc_backend.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-013c87f14b43abd0c]
module.vpc_backend.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0da52510d5acce0f3]
module.vpc_gateway.aws_nat_gateway.main[0]: Refreshing state... [id=nat-0cf76e5ad22bf9467]
module.vpc_gateway.aws_nat_gateway.main[1]: Refreshing state... [id=nat-02d817110b3e5f208]
module.vpc_backend.aws_nat_gateway.main[1]: Refreshing state... [id=nat-045d3c0b37b8114bc]
module.vpc_backend.aws_nat_gateway.main[0]: Refreshing state... [id=nat-08acd9c4009e3265f]
module.vpc_gateway.aws_route_table.private[0]: Refreshing state... [id=rtb-00ad41aee8d092d57]
module.vpc_gateway.aws_route_table.private[1]: Refreshing state... [id=rtb-06837ed6a2d51750f]
module.vpc_backend.aws_route_table.private[0]: Refreshing state... [id=rtb-089005126033aa5f9]
module.vpc_backend.aws_route_table.private[1]: Refreshing state... [id=rtb-0d69634a4f0b15f46]
module.vpc_gateway.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0723449c7123e95bb]
module.vpc_gateway.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-00dd1cdf5b15d9a03]
module.vpc_backend.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-00aeea9c6e276b4e0]
module.vpc_backend.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d31f1b8c65f48639]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks_backend.data.tls_certificate.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "cluster" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks_backend.aws_eks_cluster.main will be created
  + resource "aws_eks_cluster" "main" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "backend"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "Name" = "backend-eks"
          + "Type" = "backend"
        }
      + tags_all                      = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "backend-eks"
          + "Project"     = "sentinel-split"
          + "Type"        = "backend"
        }
      + version                       = "1.28"

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-010f9110cf822fad7",
              + "subnet-0bb98995aaab61a69",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks_backend.aws_eks_node_group.main will be created
  + resource "aws_eks_node_group" "main" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "backend"
      + disk_size              = 20
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "backend-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-010f9110cf822fad7",
          + "subnet-0bb98995aaab61a69",
        ]
      + tags                   = {
          + "Name" = "backend-node-group"
          + "Type" = "backend"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "backend-node-group"
          + "Project"     = "sentinel-split"
          + "Type"        = "backend"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 2
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks_backend.aws_iam_openid_connect_provider.cluster will be created
  + resource "aws_iam_openid_connect_provider" "cluster" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Name" = "backend-eks-oidc"
          + "Type" = "backend"
        }
      + tags_all        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "backend-eks-oidc"
          + "Project"     = "sentinel-split"
          + "Type"        = "backend"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks_backend.aws_iam_role.cluster will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "backend-eks-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "backend-eks"
          + "Type" = "backend"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "backend-eks"
          + "Project"     = "sentinel-split"
          + "Type"        = "backend"
        }
      + unique_id             = (known after apply)
    }

  # module.eks_backend.aws_iam_role.node_group will be created
  + resource "aws_iam_role" "node_group" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "backend-eks-node-group-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "backend-eks"
          + "Type" = "backend"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "backend-eks"
          + "Project"     = "sentinel-split"
          + "Type"        = "backend"
        }
      + unique_id             = (known after apply)
    }

  # module.eks_backend.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "backend-eks-cluster-role"
    }

  # module.eks_backend.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceController will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSVPCResourceController" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "backend-eks-cluster-role"
    }

  # module.eks_backend.aws_iam_role_policy_attachment.node_group_AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "node_group_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "backend-eks-node-group-role"
    }

  # module.eks_backend.aws_iam_role_policy_attachment.node_group_AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "node_group_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "backend-eks-node-group-role"
    }

  # module.eks_backend.aws_iam_role_policy_attachment.node_group_AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "node_group_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "backend-eks-node-group-role"
    }

  # module.eks_backend.aws_security_group.cluster will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS cluster control plane"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "backend-eks-cluster-sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "backend-eks-cluster-sg"
          + "Type" = "backend"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "backend-eks-cluster-sg"
          + "Project"     = "sentinel-split"
          + "Type"        = "backend"
        }
      + vpc_id                 = "vpc-07e8757a7df2c748c"
    }

  # module.eks_gateway.data.tls_certificate.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "cluster" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks_gateway.aws_eks_cluster.main will be created
  + resource "aws_eks_cluster" "main" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "gateway"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "Name" = "gateway-eks"
          + "Type" = "gateway"
        }
      + tags_all                      = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "gateway-eks"
          + "Project"     = "sentinel-split"
          + "Type"        = "gateway"
        }
      + version                       = "1.28"

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-0592fa13d6af73c51",
              + "subnet-0dddcaf81fef29b94",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks_gateway.aws_eks_node_group.main will be created
  + resource "aws_eks_node_group" "main" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "gateway"
      + disk_size              = 20
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "gateway-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0592fa13d6af73c51",
          + "subnet-0dddcaf81fef29b94",
        ]
      + tags                   = {
          + "Name" = "gateway-node-group"
          + "Type" = "gateway"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "gateway-node-group"
          + "Project"     = "sentinel-split"
          + "Type"        = "gateway"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 2
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks_gateway.aws_iam_openid_connect_provider.cluster will be created
  + resource "aws_iam_openid_connect_provider" "cluster" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Name" = "gateway-eks-oidc"
          + "Type" = "gateway"
        }
      + tags_all        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "gateway-eks-oidc"
          + "Project"     = "sentinel-split"
          + "Type"        = "gateway"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks_gateway.aws_iam_role.cluster will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gateway-eks-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "gateway-eks"
          + "Type" = "gateway"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "gateway-eks"
          + "Project"     = "sentinel-split"
          + "Type"        = "gateway"
        }
      + unique_id             = (known after apply)
    }

  # module.eks_gateway.aws_iam_role.node_group will be created
  + resource "aws_iam_role" "node_group" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gateway-eks-node-group-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "gateway-eks"
          + "Type" = "gateway"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "gateway-eks"
          + "Project"     = "sentinel-split"
          + "Type"        = "gateway"
        }
      + unique_id             = (known after apply)
    }

  # module.eks_gateway.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "gateway-eks-cluster-role"
    }

  # module.eks_gateway.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceController will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSVPCResourceController" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "gateway-eks-cluster-role"
    }

  # module.eks_gateway.aws_iam_role_policy_attachment.node_group_AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "node_group_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "gateway-eks-node-group-role"
    }

  # module.eks_gateway.aws_iam_role_policy_attachment.node_group_AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "node_group_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "gateway-eks-node-group-role"
    }

  # module.eks_gateway.aws_iam_role_policy_attachment.node_group_AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "node_group_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "gateway-eks-node-group-role"
    }

  # module.eks_gateway.aws_security_group.cluster will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS cluster control plane"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "gateway-eks-cluster-sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "gateway-eks-cluster-sg"
          + "Type" = "gateway"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "gateway-eks-cluster-sg"
          + "Project"     = "sentinel-split"
          + "Type"        = "gateway"
        }
      + vpc_id                 = "vpc-0ed5284a4e3dab868"
    }

  # module.eks_security.aws_security_group_rule.backend_allow_gateway will be created
  + resource "aws_security_group_rule" "backend_allow_gateway" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "Allow all traffic from gateway VPC"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks_security.aws_security_group_rule.gateway_allow_backend will be created
  + resource "aws_security_group_rule" "gateway_allow_backend" {
      + cidr_blocks              = [
          + "10.1.0.0/16",
        ]
      + description              = "Allow all traffic from backend VPC"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.vpc_peering.aws_route.peer_to_vpc[0] will be created
  + resource "aws_route" "peer_to_vpc" {
      + destination_cidr_block    = "10.0.0.0/16"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-089005126033aa5f9"
      + state                     = (known after apply)
      + vpc_peering_connection_id = (known after apply)
    }

  # module.vpc_peering.aws_route.peer_to_vpc[1] will be created
  + resource "aws_route" "peer_to_vpc" {
      + destination_cidr_block    = "10.0.0.0/16"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-0d69634a4f0b15f46"
      + state                     = (known after apply)
      + vpc_peering_connection_id = (known after apply)
    }

  # module.vpc_peering.aws_route.vpc_to_peer[0] will be created
  + resource "aws_route" "vpc_to_peer" {
      + destination_cidr_block    = "10.1.0.0/16"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-00ad41aee8d092d57"
      + state                     = (known after apply)
      + vpc_peering_connection_id = (known after apply)
    }

  # module.vpc_peering.aws_route.vpc_to_peer[1] will be created
  + resource "aws_route" "vpc_to_peer" {
      + destination_cidr_block    = "10.1.0.0/16"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-06837ed6a2d51750f"
      + state                     = (known after apply)
      + vpc_peering_connection_id = (known after apply)
    }

  # module.vpc_peering.aws_vpc_peering_connection.main will be created
  + resource "aws_vpc_peering_connection" "main" {
      + accept_status = (known after apply)
      + auto_accept   = true
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = (known after apply)
      + peer_vpc_id   = "vpc-07e8757a7df2c748c"
      + tags          = {
          + "Name" = "gateway-to-backend-peering"
        }
      + tags_all      = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "gateway-to-backend-peering"
          + "Project"     = "sentinel-split"
        }
      + vpc_id        = "vpc-0ed5284a4e3dab868"
    }

Plan: 29 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + backend_eks_cluster_endpoint          = (known after apply)
  + backend_eks_cluster_id                = (known after apply)
  + backend_eks_cluster_security_group_id = (known after apply)
  + gateway_eks_cluster_endpoint          = (known after apply)
  + gateway_eks_cluster_id                = (known after apply)
  + gateway_eks_cluster_security_group_id = (known after apply)
  + vpc_peering_connection_id             = (known after apply)
  + vpc_peering_status                    = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @rapydevops-gh, Action: `pull_request`, Workflow: `Terraform Infrastructure`*